Repository: WebTekk/Ragtonia
Catalog: resources/locale/*_messages.po
Languages: de_ch

source: About the Empire
de_ch: Über das Imperium

source: Form of government
de_ch: Regierungsform

source: Military
de_ch: Militärisch

source: Government
de_ch: Regierungsform

source: History
de_ch: Geschichte

source: Ragtonia is an empire with an emperor in perpetuity.
de_ch: Ragtonia ist ein Imperium mit einem ewigen Imperator.

source: Delegates
de_ch: Abgeordneter

source: Peace negotiations, etc.
de_ch: Friedensverhandlungen usw.

source: Head of Industry
de_ch: Leiter Industrie

source: Head of health care
de_ch: Leiter Gesundheitswesen

source: Head of propaganda
de_ch: Leiter Propaganda

source: Head of research
de_ch: Leiter Forschung

source: Head of finance
de_ch: Leiter Finanzwesen

source: Head of military intelligence
de_ch: Leiter Nachrichtendienst

source: 2. deputy
de_ch: 2. Stellvertreter

source: On-messages the 1. deputy.
de_ch: Vertritt den 1. Stellvertreter.

source: 1. deputy
de_ch: 1. Stellvertreter

source: On-messages the emperor.
de_ch: Vertritt den Imperator.

source: Emperor's right hand
de_ch: Rechte Hand des Imperators

source: Only the emperor has a higher force than the emperor's right hand.
de_ch: Nur der Imperator hat mehr Macht als die rechte Hand des Imperators.

source: Emperor
de_ch: Imperator

source: The legend of Ragnaron the 1st
de_ch: Die Legende von Ragnaron dem 1.

source: historyOfRagnaronTextOne
de_ch: Ragnaron der 1. war ein sehr kluger König und wegen der Unterdrückung von Orion schmiedete er Pläne um den Krieg gegen Orion für immer zu beenden. Nur das Problem war, wenn sie verlieren würden und nicht genug gestärkt wurden vor der nächsten Schlacht, dann würde sie Orion wahrscheinlich ausrotten. Deshalb beschloss Ragnaron, Orion nur so zu schwächen, dass sie einige Zeit Ruhe hatten um die Armee wieder zu stärken. So kam es das dieser Schlachtplan zustande kam:

source: historyOfRagnaronTextTwo
de_ch: In der Nacht ermutigte der König selbst seine Leute mit den Worten: «Söhne und Töchter Ragtonias, meine Brüder und Schwestern! In euren Augen sehe ich dieselbe Furcht, die auch mich verzagen liesse. Der Tag mag kommen da der Mut der Menschen erlischt, da wir unsere Gefährten im Stich lassen und aller Freundschaft Bande bricht. Doch dieser Tag ist noch fern! Die Stunde der Wölfe und zerschmetterter Schilde, da das Zeitalter der Menschen tosend untergeht. Doch dieser Tag ist noch fern. Denn morgen kämpfen wir. Bei allem was euch teuer ist, auf dieser Erde, sage ich haltet stand Menschen Ragtonias!» Früh am nächsten Morgen ritt Ragnaron der 1. auf seinem Pferd Epona los. Auf dem Weg begegneten sie einem Botschafter, der ihnen berichtete, dass die anderen Truppen bereit seien. Bei der Schlucht angekommen hielt der König inne und schaute auf das Lager hinunter und als die ersten Sonnenstrahlen über die Baumwipfel stiegen, preschte er die Schlucht hinunter auf die feindlichen Truppen zu. Als die Leute von Orion sahen, dass der König unter ihnen war griffen auch sie an, denn sie hofften mit dem Tod des Königs, Ragtonia zu schwächen und zu besiegen. Da warf Ragnaron seinen Speer gegen einen Felsen der Speer zerschellte. Das war das Zeichen die anderen Truppen griffen von allen Seiten an. Die Oriontruppen waren dadurch sehr überrascht. Die Schlacht hielt drei Tage und drei Nächte an. Von beiden Seiten waren raffinierte Züge zu sehen. Als einige Männer Orions begannen schwere, brennende Fässer auf die Männer Ragtonias zu rollen, sprang Ragnaron von Epona um eines der Fässer aufzuhalten eine ganze Gruppe seiner Soldaten, zu zermalmen. Es überrollte ihn und bremste ab bis es schliesslich anhielt. Doch Ragnaron der 1. war so geschwächt das er um nicht zu fallen sich auf Epona stützen musste. Da kam der damalige Anführer von Orion und forderte ihn heraus. Nach einem schweren Kampf besiegte ihn Ragnaron und liess ihn schliesslich gefangen nehmen. Doch der Anführer stiess sein Schwert in Ragnarons Brust. Darauf hin, wurde er von wütenden Männern sofort umgebracht. Doch Ragnaron starb noch auf dem Schlachtfeld. Er wurde in Helms Klamm, seiner Festung, begraben. Ein Legende behauptet das Epona noch lebte und von Ragnarons Geist begleitet würde, aber das ist nur eine Legende.

source: Military ranks
de_ch: Militärische Ränge

source: Ground team
de_ch: Boden Team

source: Recruit
de_ch: Rekrut

source: Soldier
de_ch: Soldat

source: Get and perform commands.
de_ch: Erhält Befehle und führt diese aus.

source: Instructor
de_ch: Ausbildner

source: Instructs recruits and special forces.
de_ch: Bildet Rekruten und Spezialeinheiten aus.

source: Driver
de_ch: Fahrer

source: Drives vehicles.
de_ch: Fährt Fahrzeuge.

source: Corporal
de_ch: Korporal

source: Get and perform commands from a squad leader.
de_ch: Erhält Befehle von einem Truppführer und führt diese aus.

source: Squad leader for squads up to 10 man.
de_ch: Führt Trupps von bis zu 10 Mann.

source: Leading assistant.
de_ch: Führungsgehilfe.

source: Lieutenant
de_ch: Leutnant

source: Platoon commander for platoons up to 4 companies with 40 man.
de_ch: Führt einen Zug aus 4 Trupps mit bis zu 40 Mann.

source: Captain
de_ch: Hauptmann

source: Leads companies, artillery or air defences with 4 platoons up to 160 man.
de_ch: Leitet eine Kompanien, Artillerien oder Flugabwehr Einheiten bestehend aus 4 Zügen mit bis zu 160 Mann.

source: Colonel
de_ch: Oberst

source: Leads battalions with 4 companies up to 640 man.
de_ch: Führt ein Bataillon aus 4 Kompanien mit bis zu 640 Mann.

source: Regiment leader
de_ch: Regiment Führer

source: Leads regiment with 4 battalions up to 2560 man.
de_ch: Führt ein Regiment aus 4 Bataillonen mit bis zu 2560 Mann.

source: Commandant
de_ch: Kommandant

source: Leads all units in a specified territory up to a planet.
de_ch: Führt alle Einheiten in einem zugewiesenen Bereich in der Grösse von bis zu einem Planeten.

source: Leads all units in a system.
de_ch: Führt alle Einheiten in einem System.

source: Air support
de_ch: Lufteinheiten

source: Gunner
de_ch: Kanonier

source: Hunter pilot
de_ch: Jägerpilot

source: Cruiser Pilot
de_ch: Kreuzerpilot

source: Star Destroyer Pilot
de_ch: Sternzerstörerpilot

source: Super Star Destroyer Pilot
de_ch: Supersternzerstörerpilot

source: Death Star Pilot
de_ch: Todessternpilot

source: Leads his own ship.
de_ch: Leitet sein eigenes Schiff.

source: Fleet Commander
de_ch: Flottenkommandant

source: Leads the whole fleet.
de_ch: Leitet die gesamte Flotte

source: Superordinate
de_ch: Übergeordnet

source: Strategist
de_ch: Stratege

source: Develops strategies for all units.
de_ch: Entwickelt Strategien für sämtliche Einheiten.

source: Direct leader of the army.
de_ch: Direkter Befehlshaber der Armee.

source: Games
de_ch: Spiele

source: Welcome to Ragtonia!
de_ch: Willkommen in Ragtonia!

source: Language
de_ch: Sprache

source: German
de_ch: Deutsch

source: English
de_ch: Englisch
